app/controllers/blackjack_controller.rb

  def start

    @cards = Dir["*/assets/images/*.png"]
    #Create Regex to assign a value to a card. And fill the database with it if they do not have
    #what we want

    if Card.all.count < 52
---
SELECT COUNT(*) FROM "cards"