app/controllers/blackjack_controller.rb

  def create

    @cards = Dir["*/assets/images/*.png"]
    #Create Regex to assign a value to a card. And fill the database with it if they do not have
    #what we want

    if Card.all.count < 52
      @cards.each do |card|
        value = card.split("app/assets/images/").pop.split("_of_").shift
        if value == "ace"
          Card.create(name:card,value:11)
---
SELECT COUNT(*) FROM "cards"
INSERT INTO "cards" ("name", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "app/assets/images/10_of_clubs.png"], ["value", 10], ["created_at", "2015-10-23 19:47:33.781404"], ["updated_at", "2015-10-23 19:47:33.781404"]]